import kebabSrc from 'src/assets/images/kebab.png';
import pizzaSrc from 'src/assets/images/pizza.png';
import noodlesSrc from 'src/assets/images/noodles.png';

/**
 * What I want to do ?
 * I want to minimize the data size but keeping the necessary data
 * * the generalPlans description will be same just the number of meals || snack will be different
 */
export const generalPlansConfig = {
  7: {
    meals: [
      { count: 1, price: 100, discount: 0 },
      { count: 2, price: 180, discount: 0 },
      { count: 3, price: 240, discount: 0 },
      { count: 4, price: 300, discount: 0 },
    ],
    snacks: [
      { count: 1, price: 50, discount: 0 },
      { count: 2, price: 90, discount: 0 },
    ],
  },

  14: {
    meals: [
      { count: 1, price: 180, discount: 0 },
      { count: 2, price: 340, discount: 0 },
      { count: 3, price: 480, discount: 0 },
      { count: 4, price: 600, discount: 0 },
    ],
    snacks: [
      { count: 1, price: 90, discount: 0 },
      { count: 2, price: 170, discount: 0 },
    ],
  },

  27: {
    meals: [
      { count: 1, price: 320, discount: 0 },
      { count: 2, price: 600, discount: 0 },
      { count: 3, price: 840, discount: 0 },
      { count: 4, price: 1050, discount: 0 },
    ],
    snacks: [
      { count: 1, price: 150, discount: 0 },
      { count: 2, price: 280, discount: 0 },
    ],
  },
};

export const customPlansConfig = {
  7: [
    {
      category: 'IntermittentFasting',
      diets: [
        {
          title: 'fasting16-8',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 149,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 21,
          snacksCount: 7,
        },
        {
          title: 'fasting14-10',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 149,
          imgSrc: noodlesSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 21,
          snacksCount: 7,
        },
      ],
    },
    {
      category: 'popularDiets',
      diets: [
        {
          title: 'lowCarb',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 149,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 21,
          snacksCount: 7,
        },
        {
          title: 'cleanBulk',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 149,
          discount: 0,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 21,
          snacksCount: 7,
        },
        {
          title: 'fastBulk',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 149,
          discount: 0,
          imgSrc: pizzaSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 21,
          snacksCount: 7,
        },
      ],
    },
  ],
  14: [
    {
      category: 'IntermittentFasting',
      diets: [
        {
          title: 'fasting16-8',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 269,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 42,
          snacksCount: 14,
        },
        {
          title: 'fasting14-10',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 269,
          discount: 0,
          imgSrc: noodlesSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 42,
          snacksCount: 14,
        },
      ],
    },
    {
      category: 'popularDiets',
      diets: [
        {
          title: 'lowCarb',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 269,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 42,
          snacksCount: 14,
        },
        {
          title: 'cleanBulk',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 269,
          discount: 0,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 42,
          snacksCount: 14,
        },
        {
          title: 'fastBulk',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 269,
          discount: 0,
          imgSrc: pizzaSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 42,
          snacksCount: 14,
        },
      ],
    },
  ],
  27: [
    {
      category: 'IntermittentFasting',
      diets: [
        {
          title: 'fasting16-8',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 399,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 81,
          snacksCount: 27,
        },
        {
          title: 'fasting14-10',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 399,
          discount: 0,
          imgSrc: noodlesSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 81,
          snacksCount: 27,
        },
      ],
    },
    {
      category: 'popularDiets',
      diets: [
        {
          title: 'lowCarb',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",

          discount: 0,
          price: 399,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 81,
          snacksCount: 27,
        },
        {
          title: 'cleanBulk',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 399,
          discount: 0,
          imgSrc: kebabSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 81,
          snacksCount: 27,
        },
        {
          title: 'fastBulk',
          subtitle: 'subtitle',
          description:
            "<h5 style='margin-top: 16px;'>الصيام المتقطع 16:8</h5> <span>هو نمط غذائي يتضمن الصيام لمدة 16 ساعة متتالية في اليوم وتناول الطعام خلال فترة 8 ساعات المتبقية. مثلاً، يمكن تناول الطعام بين الساعة 12 ظهرًا و8 مساءً، والصيام من الساعة 8 مساءً حتى 12 ظهرًا في اليوم التالي.</span><h5 style='margin-top: 16px;'>الصيام المتقطع 16:8 شهير لفقدان الوزن لعدة أسباب:</h5><ol style='margin-top: 16px;'><li style='margin-bottom: 8px;'><h6>تقييد السعرات الحرارية:</h6><p>عندما يكون لديك نافذة زمنية محدودة لتناول الطعام، قد تجد نفسك تستهلك سعرات حرارية أقل بشكل طبيعي.</p></li><li style='margin-bottom: 8px;'><h6>تحسين حساسية الأنسولين:</h6><p>الصيام يمكن أن يحسن حساسية الجسم للأنسولين، مما يساعد في استقرار مستويات السكر في الدم وتقليل تخزين الدهون.</p></li><li style='margin-bottom: 8px;'><h6>زيادة معدل الأيض:</h6><p>الصيام يمكن أن يزيد من معدل الأيض ويساعد الجسم على حرق الدهون بشكل أكثر فعالية.</p></li><li style='margin-bottom: 8px;'><h6>سهولة الالتزام:</h6><p>الكثير من الأشخاص يجدون هذا النمط الغذائي أسهل في الالتزام به مقارنةً بالحميات الغذائية التقليدية التي تتطلب حسابات دقيقة للسعرات الحرارية.</p></li></ol>",
          price: 399,
          discount: 0,
          imgSrc: pizzaSrc,
          mealsInDay: 3,
          snacksInDay: 1,
          mealsCount: 81,
          snacksCount: 27,
        },
      ],
    },
  ],
};
